In [241]:
import pandas as pd

In [242]:
dados = {
    "Nome": ["Taynan", "Luigi", "Samuel", "Agata"],
    "Idade": [98, 20, 200, 100],
    "Cidade": ["Xavantina", "Londres", "Rio de Janeiro", "União Flasco"]
}

In [243]:
data_frame = pd.DataFrame(dados)

In [244]:
data_frame

     Nome  Idade          Cidade
0  Taynan     98       Xavantina
1   Luigi     20         Londres
2  Samuel    200  Rio de Janeiro
3   Agata    100    União Flasco

In [245]:
#Exibir o primeiro elemento
data_frame.head(1)

     Nome  Idade     Cidade
0  Taynan     98  Xavantina

In [246]:
#Exibir o último elemento
data_frame.tail(1)

    Nome  Idade        Cidade
3  Agata    100  União Flasco

In [247]:
dados_notas_disciplinas = {
    "Nome": ["Murilo", "Anthony", "Neymar", "Pajé"],
    "Matemática": [100, 67, 98, 79],
    "Física": [80, 92, 100, 90],
    "Química": [60, 60, 100, 80],
}

In [248]:
df_notas = pd.DataFrame(dados_notas_disciplinas)

In [249]:
df_notas

      Nome  Matemática  Física  Química
0   Murilo         100      80       60
1  Anthony          67      92       60
2   Neymar          98     100      100
3     Pajé          79      90       80

In [250]:
df_notas["Média"] = df_notas[["Matemática", "Física", "Química"]].mean(axis=1)
df_notas

      Nome  Matemática  Física  Química      Média
0   Murilo         100      80       60  80.000000
1  Anthony          67      92       60  73.000000
2   Neymar          98     100      100  99.333333
3     Pajé          79      90       80  83.000000

In [251]:
"""
Calculando a média das notas por aluno.
A primeira lista, informada como parâmetro, entre colchetes duplos, diz respeito as colunas do DataFrame que serão consideradas no cálculo da média.
Lembrando que tais colunas são as chaves do dicionário que foi usado na criaão do DataFrame.
'mean(axis=1)', significa:
O eixo 0 atuará em todas as LINHAS em cada COLUNAS;
O eixo 1 atuará em todas as COLUNAS em cada LINHA;
Portanto, uma média no eixo 0 será a média de todas as linhas e cada coluna, e uma média no eixo 1 será a média de todas as colunas em cada linha.
"""

"\nCalculando a média das notas por aluno.\nA primeira lista, informada como parâmetro, entre colchetes duplos, diz respeito as colunas do DataFrame que serão consideradas no cálculo da média.\nLembrando que tais colunas são as chaves do dicionário que foi usado na criaão do DataFrame.\n'mean(axis=1)', significa:\nO eixo 0 atuará em todas as LINHAS em cada COLUNAS;\nO eixo 1 atuará em todas as COLUNAS em cada LINHA;\nPortanto, uma média no eixo 0 será a média de todas as linhas e cada coluna, e uma média no eixo 1 será a média de todas as colunas em cada linha.\n"

In [252]:
#Alunos acima da média

if df_notas["Média"] > 82:
    df_notas["Aprovado"] = df_notas[["Matemática", "Física", "Química"]]
    df_notas
else:
    df_notas = df_notas["Reprovado"]
    df_notas

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().